tap "domt4/autoupdate"
tap "github/bootstrap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Record and share terminal sessions
brew "asciinema"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generic library support script
brew "libtool"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# macOS Credential Helper for Docker
brew "docker-credential-helper", link: false
# Text processing system for reStructuredText
brew "docutils", link: false
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Spellchecker wrapping library
brew "enchant"
# In-band and out-of-band IPMI (v1.5/2.0) software
brew "freeipmi"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Alternative to top/htop
brew "glances"
# Asynchronous event library
brew "libevent"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Make JSON greppable
brew "gron"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# GNU utilities for networking
brew "inetutils"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-format archive and compression library
brew "libarchive"
# Collection library providing GObject-based interfaces
brew "libgee"
# Operating System information database
brew "libosinfo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Toolkit library for asynchronous network I/O with protocol stacks
brew "libre"
# General purpose TCP-IP emulator
brew "libslirp"
# C virtualization API
brew "libvirt"
# HTTP/2 C Library
brew "nghttp2"
# Libvirt API for glib-based programs
brew "libvirt-glib"
# GNOME XML library
brew "libxml2"
# XML security library
brew "libxmlsec1"
# CLI client for interacting with LXD
brew "lxc"
# Text-based web browser
brew "lynx"
# Fast and user friendly build system
brew "meson"
# Terminal-based visual file manager
brew "midnight-commander", args: ["HEAD"]
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# OpenShift command-line interface tools
brew "openshift-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Emulator for x86 and PowerPC
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Python version management
brew "pyenv", args: ["HEAD"]
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Cross-platform application and UI framework
brew "qt"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Repository tool for Android development
brew "repo"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# SSH server & client auditing
brew "ssh-audit"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Instant terminal sharing
brew "tmate"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Bash completion for Vagrant
brew "vagrant-completion"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Compare files and folders
cask "beyond-compare"
# Draw structured diagrams
cask "dia"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-menlo-for-powerline"
cask "font-powerline-symbols"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# IDE for professional Python development
cask "pycharm"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Open-source version of the X.Org X Window System
cask "xquartz"
